In [9]:
import pandas as pd
import numpy as np
pd.__version__

'1.1.3'

In [5]:
arr=[0,1,2,3,4]
df=pd.Series(arr)
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [6]:
dates=pd.date_range("today",periods=6)
dates

DatetimeIndex(['2021-06-10 21:59:34.778767', '2021-06-11 21:59:34.778767',
               '2021-06-12 21:59:34.778767', '2021-06-13 21:59:34.778767',
               '2021-06-14 21:59:34.778767', '2021-06-15 21:59:34.778767'],
              dtype='datetime64[ns]', freq='D')

In [11]:
import numpy as np
num_arr = np.random.randn(6,4)#rand函数根据给定维度生成[0,1)之间的数据，包含0，不包含1
columns=["a","b","c","d"]#列名
df=pd.DataFrame(num_arr,index=dates,columns=columns)
df

                                   a         b         c         d
2021-06-10 21:59:34.778767 -0.679198 -0.614369  0.056727  0.501647
2021-06-11 21:59:34.778767  1.398022 -2.246567 -0.067774 -0.104380
2021-06-12 21:59:34.778767  0.721407 -0.998607 -1.812100 -0.758304
2021-06-13 21:59:34.778767  0.561956 -0.069906  1.225146  1.251780
2021-06-14 21:59:34.778767 -0.905648 -0.731763  1.220031 -2.558438
2021-06-15 21:59:34.778767  2.694162  0.809917  0.531216  0.207390

In [13]:
#df = pd.read_csv('test.csv',encoding="gdk, sep=';')

In [61]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5,2 , 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  2.0       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       9 non-null      object
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [57]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [21]:
df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat    3
c  snake  0.5
d    dog
e    dog    5
f    cat    2
g  snake  4.5
h    cat  NaN
i    dog    7
j    dog    3

In [26]:
df.loc[df.index[[3,4,8]],['animal','age']]

  animal age  visits priority
d    dog           3      yes
e    dog   5       2       no
i    dog   7       2       no

In [29]:
df[df['age']>3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [31]:
df[df['age'].isnull()]

  animal  age  visits priority
h    cat  NaN       1      yes

In [33]:
df[(df['age']>2)&(df['age']<4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [34]:
df.loc["f",'age']=1.5

In [36]:
df['visits'].sum()

19

In [38]:
df.groupby('animal')['age'].mean()#计算不同种类animal的平均数

animal
cat      2.333333
dog      4.250000
snake    2.500000
Name: age, dtype: float64

In [39]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [48]:
df.sort_values(by=['age','visits'],ascending=[False,True])#按照age降序排序再按visits升序排列

  animal  age  visits priority
i    dog  7.0       2      NaN
e    dog  5.0       2      NaN
g  snake  4.5       1      NaN
j    dog  3.0       1      NaN
b    cat  3.0       3      NaN
a    cat  2.5       1      NaN
d    dog  2.0       3      NaN
f    cat  1.5       3      NaN
c  snake  0.5       2      NaN
h    cat  NaN       1      NaN

In [63]:
df['animal']=df['animal'].replace('snake','python')
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  2.0       3      yes
e     dog  5.0       2       no
f     cat  2.0       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

In [64]:
df.loc['k']=[5.5,'dog','no',2]
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat    3      3      yes
c  python  0.5      2       no
d     dog    2      3      yes
e     dog    5      2       no
f     cat    2      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog    7      2       no
j     dog    3      1       no
k     5.5  dog     no        2

In [65]:
df=df.drop('k')
df

   animal  age visits priority
a     cat  2.5      1      yes
b     cat    3      3      yes
c  python  0.5      2       no
d     dog    2      3      yes
e     dog    5      2       no
f     cat    2      3       no
g  python  4.5      1       no
h     cat  NaN      1      yes
i     dog    7      2       no
j     dog    3      1       no

In [6]:
#有一列整数列A的DatraFrame，删除数值重复的行
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df1 = df.loc[df['A'].shift()!=df['A']]
df1

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [12]:
#一个全数值DatraFrame，每个数字减去该行的平均数
df = pd.DataFrame(np.random.random(size=(5, 3)))
df1=df.sub(df.mean(axis=1),axis=0)
df1

          0         1         2
0  0.362219 -0.185767  0.208441
1  0.460678  0.179765  0.258442
2 -0.444548 -0.140329 -0.419455
3  0.038981  0.096475 -0.018557
4 -0.417330  0.049856 -0.028872

In [15]:
#给定DataFrame，求A列每个值的前3大的B的值的和
df = pd.DataFrame({'A': list('aaabbcaabcccbbc'), 
                   'B': [12,345,3,1,45,14,4,52,54,
                         23,235,21,57,3,87]})
df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)
df1

A
a    409
b    156
c    345
Name: B, dtype: int64

In [22]:
#给定DataFrame，有列A, B，A的值在1-100（含），对A列每10步长，求对应的B的和
df = pd.DataFrame({'A': [1,2,11,11,33,34,35,40,79,99], 
                   'B': [1,2,11,11,33,34,35,40,79,99]})
df1 = df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()
df1

A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

In [28]:
#给定DataFrame，计算每个元素至左边最近的0（或者至开头）的距离，生成新列y
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]},index=labels)
izero = np.r_[-1, (df['X'] == 0).to_numpy().nonzero()[0]] # 标记0的位置
idx = np.arange(len(df))
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]
df

   X  Y
a  7  1
b  2  2
c  0  0
d  3  1
e  4  2
f  2  3
g  5  4
h  0  0
i  3  1
j  4  2

In [31]:
#一个全数值的DataFrame，返回最大3个值的坐标
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df.unstack().sort_values()[-3:].index.tolist()

          0         1         2
0  0.085021  0.958628  0.260211
1  0.975106  0.290867  0.733675
2  0.590457  0.991721  0.647160
3  0.903695  0.219990  0.266501
4  0.627765  0.326645  0.515176

[(1, 0), (0, 1), (1, 2)]